GHB2/src/Documents/гхб_УПКТ/гхб_УПКТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_УПКТ</name>
  <basedOn>Document.гхб_УПКТ</basedOn>
  <registerRecords>InformationRegister.гхб_ДанныеПерсональныхКабинетовТакси</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гхб_ВидыОперацийУПКТ</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.гхб_ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныйКабинетТакси</name>
    <type>
      <types>CatalogRef.гхб_ПерсональныеКабинетыТакси</types>
    </type>
  </attributes>
  <attributes>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>еМайлСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.гхб_УПКТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Финансист</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонФинансиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>еМайлРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>еМайлФинансиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ДанныеПерсональныхКабинетовТакси/гхб_ДанныеПерсональныхКабинетовТакси.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ДанныеПерсональныхКабинетовТакси</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.гхб_ЦФО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </resources>
  <dimensions>
    <name>ПерсональныйКабинетТакси</name>
    <type>
      <types>CatalogRef.гхб_ПерсональныеКабинетыТакси</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ВидыОперацийУПКТ/гхб_ВидыОперацийУПКТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ВидыОперацийУПКТ</name>
  <enumValues>
    <name>ОткрытиеКабинета</name>
  </enumValues>
  <enumValues>
    <name>РедактированиеКабинета</name>
  </enumValues>
  <enumValues>
    <name>БлокированиеКабинета</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_УПКТ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВидОперации = Перечисления.гхб_ВидыОперацийУПКТ.БлокированиеКабинета Тогда
		
		стВозврат = НайтиАктивнуюЗаписьПоКабинету();
		
		Если Не стВозврат.ЕстьАктивнаяЗапись Тогда
			ОбщегоНазначения.СообщитьПользователю("Нет записи по открытию кабинета!",,,, Отказ);
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.гхб_ВидыОперацийУПКТ.ОткрытиеКабинета Тогда
		
		стВозврат = НайтиАктивнуюЗаписьПоКабинету();
		
		Если стВозврат.ЕстьАктивнаяЗапись Тогда
			
			текстСообщения = "По кабинету " 
										+ ПерсональныйКабинетТакси 
										+ " есть активная запись документ " + стВозврат.Регистратор
										+ " Сотрудник " + стВозврат.Сотрудник
										+ " Организация " + стВозврат.Организация
										+ " БазаХолдинга " + стВозврат.БазаХолдинга + " !";
			ОбщегоНазначения.СообщитьПользователю(текстСообщения,,,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	СоздатьЗаписатьДвиженияДанныхКабинетовТакси();
	
КонецПроцедуры

Процедура ПроверитьДокументыБудущихПериодов(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	гхб_УПКТ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гхб_УПКТ КАК гхб_УПКТ
	|ГДЕ
	|	гхб_УПКТ.Дата > &Дата
	|	И гхб_УПКТ.Ссылка <> &Ссылка
	|	И гхб_УПКТ.Проведен
	|	И гхб_УПКТ.ПерсональныйКабинетТакси = &ПерсональныйКабинетТакси";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПерсональныйКабинетТакси", ПерсональныйКабинетТакси);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьПользователю("В базе существует проведенный документ датой старше даты документа " + Выборка.Ссылка + " редактирование документа запрещено!",,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаписатьДвиженияДанныхКабинетовТакси()

	Движения.гхб_ДанныеПерсональныхКабинетовТакси.Записывать = Истина;
	Движение = Движения.гхб_ДанныеПерсональныхКабинетовТакси.Добавить();
	Движение.Период = Дата;
	Движение.ПерсональныйКабинетТакси = ПерсональныйКабинетТакси;
	Движение.БазаХолдинга = БазаХолдинга;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Блокирован = ВидОперации = Перечисления.гхб_ВидыОперацийУПКТ.БлокированиеКабинета;
	Движение.Дивизион = Дивизион;
	Движение.ЦФО = ЦФО;
	Движение.Плательщик = Плательщик;
	Движение.Должность = Должность;

КонецПроцедуры

Функция НайтиАктивнуюЗаписьПоКабинету()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Регистратор КАК Регистратор,
	|	гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Сотрудник КАК Сотрудник,
	|	гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Организация КАК Организация,
	|	гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.БазаХолдинга КАК БазаХолдинга
	|ИЗ
	|	РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних(
	|			&ДатаСреза,
	|			Регистратор <> &Ссылка
	|				И ПерсональныйКабинетТакси = &ПерсональныйКабинетТакси) КАК гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних
	|ГДЕ
	|	НЕ гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован";
	
	Запрос.УстановитьПараметр("ДатаСреза", НачалоДня(Дата) - 1);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПерсональныйКабинетТакси", ПерсональныйКабинетТакси);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЕстьАктивнаяЗапись,Регистратор,Сотрудник,Организация,БазаХолдинга", Истина,
																									Выборка.Регистратор,
																									Выборка.Сотрудник,
																									Выборка.Организация,
																									Выборка.БазаХолдинга);
	Иначе
		Возврат Новый Структура("ЕстьАктивнаяЗапись", Ложь);
	КонецЕсли;
	
КонецФункции // НайтиАктивнуюЗаписьПоКабинету()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.гхб_УПКТ") Тогда
		
		БазаХолдинга = ДанныеЗаполнения.БазаХолдинга;
		Дивизион = ДанныеЗаполнения.Дивизион;
		Должность = ДанныеЗаполнения.Должность;
		еМайлРуководителя = ДанныеЗаполнения.еМайлРуководителя;
		еМайлСотрудника = ДанныеЗаполнения.еМайлСотрудника;
		еМайлФинансиста = ДанныеЗаполнения.еМайлФинансиста;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПерсональныйКабинетТакси = ДанныеЗаполнения.ПерсональныйКабинетТакси;
		Плательщик = ДанныеЗаполнения.Плательщик;
		Руководитель = ДанныеЗаполнения.Руководитель;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Основание = ДанныеЗаполнения.Ссылка;
		ТелефонРуководителя = ДанныеЗаполнения.ТелефонРуководителя;
		ТелефонСотрудника = ДанныеЗаполнения.ТелефонСотрудника;
		ТелефонФинансиста = ДанныеЗаполнения.ТелефонФинансиста;
		ФизЛицо = ДанныеЗаполнения.ФизЛицо;
		Финансист = ДанныеЗаполнения.Финансист;
		ЦФО = ДанныеЗаполнения.ЦФО;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения  Тогда
		ПроверитьДокументыБудущихПериодов(Отказ);
	КонецЕсли;
	
КонецПроцедуры
